================================================================================
simple tuple
================================================================================

foo = [1, 2, "foo"]

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (tuple
        (tuple_start)
        (numeric_lit)
        (numeric_lit)
        (string_lit
          (quoted_template_start)
          (template_literal)
          (quoted_template_end))
        (tuple_end)))))

================================================================================
multiline tuple
================================================================================

foo = [
  1,
  2,
  "foo"
]

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (tuple
        (tuple_start)
        (numeric_lit)
        (numeric_lit)
        (string_lit
          (quoted_template_start)
          (template_literal)
          (quoted_template_end))
        (tuple_end)))))

================================================================================
empty tuple
================================================================================

foo = []

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (tuple
        (tuple_start)
        (tuple_end)))))

================================================================================
multiline empty tuple
================================================================================

foo = [
]

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (tuple
        (tuple_start)
        (tuple_end)))))

================================================================================
object
================================================================================

foo = {1: 2, "foo"="bar"}

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (object
        (object_start)
        (object_elem
          (numeric_lit)
          (numeric_lit))
        (object_elem
          (string_lit
            (quoted_template_start)
            (template_literal)
            (quoted_template_end))
          (string_lit
            (quoted_template_start)
            (template_literal)
            (quoted_template_end)))
        (object_end)))))

================================================================================
multiline object
================================================================================

foo = {
  1: 2,
  "foo"="bar"
}

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (object
        (object_start)
        (object_elem
          (numeric_lit)
          (numeric_lit))
        (object_elem
          (string_lit
            (quoted_template_start)
            (template_literal)
            (quoted_template_end))
          (string_lit
            (quoted_template_start)
            (template_literal)
            (quoted_template_end)))
        (object_end)))))

================================================================================
empty object
================================================================================

foo = { }

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (object
        (object_start)
        (object_end)))))

================================================================================
multiline empty object
================================================================================

foo = {
}

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (object
        (object_start)
        (object_end)))))

================================================================================
multiline object weird newlines
================================================================================

foo = { 1: 2,
  "foo"="bar"

}

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (object
        (object_start)
        (object_elem
          (numeric_lit)
          (numeric_lit))
        (object_elem
          (string_lit
            (quoted_template_start)
            (template_literal)
            (quoted_template_end))
          (string_lit
            (quoted_template_start)
            (template_literal)
            (quoted_template_end)))
        (object_end)))))

================================================================================
complex object
================================================================================

foo = {
  a = "1",
  b = "2"
}

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (object
        (object_start)
        (object_elem
          (identifier)
          (string_lit
            (quoted_template_start)
            (template_literal)
            (quoted_template_end)))
        (object_elem
          (identifier)
          (string_lit
            (quoted_template_start)
            (template_literal)
            (quoted_template_end)))
        (object_end)))))

================================================================================
complex from real world
================================================================================

worker_groups = [
    {
      name                          = "jasonb-test-group-1"
      instance_type                 = "t2.small"
      asg_desired_capacity          = 2
      additional_security_group_ids = [aws_security_group.external_connection.id]
    },
    {
      name                          = "jasonb-test-group-2"
      instance_type                 = "t2.medium"
      additional_security_group_ids = [aws_security_group.external_connection.id]
      asg_desired_capacity          = 1
    },
  ]

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (tuple
        (tuple_start)
        (object
          (object_start)
          (object_elem
            (identifier)
            (string_lit
              (quoted_template_start)
              (template_literal)
              (quoted_template_end)))
          (object_elem
            (identifier)
            (string_lit
              (quoted_template_start)
              (template_literal)
              (quoted_template_end)))
          (object_elem
            (identifier)
            (numeric_lit))
          (object_elem
            (identifier)
            (tuple
              (tuple_start)
              (get_attr
                (get_attr
                  (identifier)
                  (identifier))
                (identifier))
              (tuple_end)))
          (object_end))
        (object
          (object_start)
          (object_elem
            (identifier)
            (string_lit
              (quoted_template_start)
              (template_literal)
              (quoted_template_end)))
          (object_elem
            (identifier)
            (string_lit
              (quoted_template_start)
              (template_literal)
              (quoted_template_end)))
          (object_elem
            (identifier)
            (tuple
              (tuple_start)
              (get_attr
                (get_attr
                  (identifier)
                  (identifier))
                (identifier))
              (tuple_end)))
          (object_elem
            (identifier)
            (numeric_lit))
          (object_end))
        (tuple_end)))))
