================================================================================
for tuple expression
================================================================================

foo = [for v in ["a", "b"]: v]

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (for_tuple_expr
        (tuple_start)
        (for_intro
          (for_initializer_single)
          (tuple
            (tuple_start)
            (string_lit
              (quoted_template_start)
              (template_literal)
              (quoted_template_end))
            (string_lit
              (quoted_template_start)
              (template_literal)
              (quoted_template_end))
            (tuple_end)))
        (identifier)
        (tuple_end)))))

================================================================================
for tuple expression with index
================================================================================

foo = [for i, v in ["a", "b"]: i]

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (for_tuple_expr
        (tuple_start)
        (for_intro
          (for_initializer_pair
            (identifier)
            (identifier))
          (tuple
            (tuple_start)
            (string_lit
              (quoted_template_start)
              (template_literal)
              (quoted_template_end))
            (string_lit
              (quoted_template_start)
              (template_literal)
              (quoted_template_end))
            (tuple_end)))
        (identifier)
        (tuple_end)))))

================================================================================
for tuple expression with predicate
================================================================================

foo = [for i, v in ["a", "b", "c"]: v if pred(i)]

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (for_tuple_expr
        (tuple_start)
        (for_intro
          (for_initializer_pair
            (identifier)
            (identifier))
          (tuple
            (tuple_start)
            (string_lit
              (quoted_template_start)
              (template_literal)
              (quoted_template_end))
            (string_lit
              (quoted_template_start)
              (template_literal)
              (quoted_template_end))
            (string_lit
              (quoted_template_start)
              (template_literal)
              (quoted_template_end))
            (tuple_end)))
        (identifier)
        (function_call
          (identifier)
          (identifier))
        (tuple_end)))))

================================================================================
for object expression
================================================================================

foo = {for i, v in ["a", "b"]: v => i}

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (for_object_expr
        (object_start)
        (for_intro
          (for_initializer_pair
            (identifier)
            (identifier))
          (tuple
            (tuple_start)
            (string_lit
              (quoted_template_start)
              (template_literal)
              (quoted_template_end))
            (string_lit
              (quoted_template_start)
              (template_literal)
              (quoted_template_end))
            (tuple_end)))
        (identifier)
        (identifier)
        (object_end)))))

================================================================================
for object expression 2
================================================================================

foo = {for i, v in ["a", "b"]: v => i...}

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (for_object_expr
        (object_start)
        (for_intro
          (for_initializer_pair
            (identifier)
            (identifier))
          (tuple
            (tuple_start)
            (string_lit
              (quoted_template_start)
              (template_literal)
              (quoted_template_end))
            (string_lit
              (quoted_template_start)
              (template_literal)
              (quoted_template_end))
            (tuple_end)))
        (identifier)
        (identifier)
        (ellipsis)
        (object_end)))))
