================================================================================
simple quoted template expression
================================================================================

foo = "${ var.bar }"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (quoted_template_start)
        (template_interpolation
          (template_interpolation_start)
          (get_attr
            (identifier)
            (identifier))
          (template_interpolation_end))
        (quoted_template_end)))))

================================================================================
template for expression in quoted template
================================================================================

foo = "%{ for a in b } prefix-${a} %{ endfor }"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (quoted_template_start)
        (template_for
          (template_for_start
            (template_directive_start)
            (identifier)
            (identifier)
            (template_directive_end))
          (template_literal)
          (template_interpolation
            (template_interpolation_start)
            (identifier)
            (template_interpolation_end))
          (template_literal)
          (template_for_end
            (template_directive_start)
            (template_directive_end)))
        (quoted_template_end)))))

================================================================================
escaped template for directive
================================================================================

foo = "%{ for a in b } %%{ endfor } %{ endfor }"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (quoted_template_start)
        (template_for
          (template_for_start
            (template_directive_start)
            (identifier)
            (identifier)
            (template_directive_end))
          (template_literal)
          (template_for_end
            (template_directive_start)
            (template_directive_end)))
        (quoted_template_end)))))

================================================================================
escaped template for directive 2
================================================================================

foo = "%%{ for a in b } %%{ endfor }"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (string_lit
        (quoted_template_start)
        (template_literal)
        (quoted_template_end)))))

================================================================================
template for directive with weird whitespace
================================================================================

foo = "%{     for a in b   } %{      endfor    }"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (quoted_template_start)
        (template_for
          (template_for_start
            (template_directive_start)
            (identifier)
            (identifier)
            (template_directive_end))
          (template_literal)
          (template_for_end
            (template_directive_start)
            (template_directive_end)))
        (quoted_template_end)))))

================================================================================
template for expression in heredoc template
================================================================================

foo = <<EOF
%{ for a in b ~}

prefix-${a}

%{~ endfor }
EOF

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (heredoc_template
        (heredoc_start)
        (heredoc_identifier)
        (template_for
          (template_for_start
            (template_directive_start)
            (identifier)
            (identifier)
            (strip_marker)
            (template_directive_end))
          (template_literal)
          (template_interpolation
            (template_interpolation_start)
            (identifier)
            (template_interpolation_end))
          (template_literal)
          (template_for_end
            (template_directive_start)
            (strip_marker)
            (template_directive_end)))
        (template_literal)
        (heredoc_identifier)))))

================================================================================
empty heredoc template
================================================================================

foo = <<END
END

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (heredoc_template
        (heredoc_start)
        (heredoc_identifier)
        (heredoc_identifier)))))

================================================================================
heredoc with fake ending
================================================================================

foo = <<END
  END    not!
END

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (heredoc_template
        (heredoc_start)
        (heredoc_identifier)
        (template_literal)
        (heredoc_identifier)))))

================================================================================
quoted template expression with escaped strings and fake strip marker
================================================================================

foo = "${ " ~ " }"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (quoted_template_start)
        (template_interpolation
          (template_interpolation_start)
          (string_lit
            (quoted_template_start)
            (template_literal)
            (quoted_template_end))
          (template_interpolation_end))
        (quoted_template_end)))))

================================================================================
quoted template with nested quoted template
================================================================================

foo = "p-${ foo("v-${a.b}") }"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (quoted_template_start)
        (template_literal)
        (template_interpolation
          (template_interpolation_start)
          (function_call
            (identifier)
            (quoted_template
              (quoted_template_start)
              (template_literal)
              (template_interpolation
                (template_interpolation_start)
                (get_attr
                  (identifier)
                  (identifier))
                (template_interpolation_end))
              (quoted_template_end)))
          (template_interpolation_end))
        (quoted_template_end)))))

================================================================================
quoted template interpolation with strip markers
================================================================================

foo = "hello ${~ "world" ~} hello"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (quoted_template_start)
        (template_literal)
        (template_interpolation
          (template_interpolation_start)
          (strip_marker)
          (string_lit
            (quoted_template_start)
            (template_literal)
            (quoted_template_end))
          (strip_marker)
          (template_interpolation_end))
        (template_literal)
        (quoted_template_end)))))

================================================================================
quoted template object expression in template
================================================================================

foo = "${ {a=b}[a] }"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (quoted_template_start)
        (template_interpolation
          (template_interpolation_start)
          (index
            (object
              (object_start)
              (object_elem
                (identifier)
                (identifier))
              (object_end))
            (new_index
              (identifier)))
          (template_interpolation_end))
        (quoted_template_end)))))

================================================================================
escaped template interpolation start
================================================================================

foo = "hello $${ world"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (string_lit
        (quoted_template_start)
        (template_literal)
        (quoted_template_end)))))

================================================================================
tricky heredoc
================================================================================

foo = <<END
    contains fake endings
    END (ineligible) END
END

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (heredoc_template
        (heredoc_start)
        (heredoc_identifier)
        (template_literal)
        (heredoc_identifier)))))

================================================================================
heredoc with identifier that does not fit into the serialization buffer (should not crash)
================================================================================

foo = <<XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (heredoc_template
        (heredoc_start)
        (heredoc_identifier)
        (heredoc_identifier)))))

================================================================================
template if directive in quoted template
================================================================================

foo = "%{if cond} foo %{else} bar %{endif}"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (quoted_template_start)
        (template_if
          (template_if_intro
            (template_directive_start)
            (identifier)
            (template_directive_end))
          (template_literal)
          (template_else_intro
            (template_directive_start)
            (template_directive_end))
          (template_literal)
          (template_if_end
            (template_directive_start)
            (template_directive_end)))
        (quoted_template_end)))))

================================================================================
template nested for directives with interlaced chunks
================================================================================

foo = "%{for a in b} x %{for c in a} ${c} %{endfor} %{endfor}"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (quoted_template_start)
        (template_for
          (template_for_start
            (template_directive_start)
            (identifier)
            (identifier)
            (template_directive_end))
          (template_literal)
          (template_for
            (template_for_start
              (template_directive_start)
              (identifier)
              (identifier)
              (template_directive_end))
            (template_literal)
            (template_interpolation
              (template_interpolation_start)
              (identifier)
              (template_interpolation_end))
            (template_literal)
            (template_for_end
              (template_directive_start)
              (template_directive_end)))
          (template_literal)
          (template_for_end
            (template_directive_start)
            (template_directive_end)))
        (quoted_template_end)))))

================================================================================
template nested if directives with interlaced chunks
================================================================================

foo = "%{if a} %{if b} y %{else} x %{endif} %{endif}"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (quoted_template_start)
        (template_if
          (template_if_intro
            (template_directive_start)
            (identifier)
            (template_directive_end))
          (template_literal)
          (template_if
            (template_if_intro
              (template_directive_start)
              (identifier)
              (template_directive_end))
            (template_literal)
            (template_else_intro
              (template_directive_start)
              (template_directive_end))
            (template_literal)
            (template_if_end
              (template_directive_start)
              (template_directive_end)))
          (template_literal)
          (template_if_end
            (template_directive_start)
            (template_directive_end)))
        (quoted_template_end)))))

================================================================================
template empty if else statement
================================================================================

foo = "%{if a} %{else} %{endif}"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (quoted_template_start)
        (template_if
          (template_if_intro
            (template_directive_start)
            (identifier)
            (template_directive_end))
          (template_literal)
          (template_else_intro
            (template_directive_start)
            (template_directive_end))
          (template_literal)
          (template_if_end
            (template_directive_start)
            (template_directive_end)))
        (quoted_template_end)))))

================================================================================
template empty for statement
================================================================================

foo = "%{for a in b} %{endfor}"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (quoted_template
        (quoted_template_start)
        (template_for
          (template_for_start
            (template_directive_start)
            (identifier)
            (identifier)
            (template_directive_end))
          (template_literal)
          (template_for_end
            (template_directive_start)
            (template_directive_end)))
        (quoted_template_end)))))

================================================================================
template parenthesis in heredoc for directive with nested if 1
================================================================================

tpl6 = <<-EOF
  %{ for a in f(b) ~}
    ( %{~if a~} "true" %{~else~} "false" %{~endif~} )
  %{ endfor ~}
EOF

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (heredoc_template
        (heredoc_start)
        (heredoc_identifier)
        (template_literal)
        (template_for
          (template_for_start
            (template_directive_start)
            (identifier)
            (function_call
              (identifier)
              (identifier))
            (strip_marker)
            (template_directive_end))
          (template_literal)
          (template_if
            (template_if_intro
              (template_directive_start)
              (strip_marker)
              (identifier)
              (strip_marker)
              (template_directive_end))
            (template_literal)
            (template_else_intro
              (template_directive_start)
              (strip_marker)
              (strip_marker)
              (template_directive_end))
            (template_literal)
            (template_if_end
              (template_directive_start)
              (strip_marker)
              (strip_marker)
              (template_directive_end)))
          (template_literal)
          (template_for_end
            (template_directive_start)
            (strip_marker)
            (template_directive_end)))
        (template_literal)
        (heredoc_identifier)))))

================================================================================
template parenthesis in heredoc for directive with nested if 2
================================================================================

tpl6 = <<-EOF
  %{ for a in f(b) ~}
    ("foo")
    %{~if a~} "true" %{~else~} "false" %{~endif~}
  %{ endfor ~}
EOF

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (heredoc_template
        (heredoc_start)
        (heredoc_identifier)
        (template_literal)
        (template_for
          (template_for_start
            (template_directive_start)
            (identifier)
            (function_call
              (identifier)
              (identifier))
            (strip_marker)
            (template_directive_end))
          (template_literal)
          (template_if
            (template_if_intro
              (template_directive_start)
              (strip_marker)
              (identifier)
              (strip_marker)
              (template_directive_end))
            (template_literal)
            (template_else_intro
              (template_directive_start)
              (strip_marker)
              (strip_marker)
              (template_directive_end))
            (template_literal)
            (template_if_end
              (template_directive_start)
              (strip_marker)
              (strip_marker)
              (template_directive_end)))
          (template_literal)
          (template_for_end
            (template_directive_start)
            (strip_marker)
            (template_directive_end)))
        (template_literal)
        (heredoc_identifier)))))
